
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 2 to change, 6 to destroy.</code></pre>

* Update
  * azurerm_api_management_subscription.fee_pay_team_telephony_subscription
  * azurerm_api_management_subscription.pcipal_supplier_subscription
* Delete
  * module.payment-database-v15.azurerm_monitor_action_group.db-alerts-action-group[0]
  * module.payment-database-v15.azurerm_monitor_metric_alert.db_alert_cpu[0]
  * module.payment-database-v15.azurerm_monitor_metric_alert.db_alert_memory[0]
  * module.payment-database-v15.azurerm_monitor_metric_alert.db_alert_storage_utilization[0]
* Replace
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.fee_pay_team_telephony_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "fee_pay_team_telephony_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/subscriptions/7229a544-a882-4520-a81e-2cd4ed6f0031"
        # (10 unchanged attributes hidden)
    }

  # azurerm_api_management_subscription.pcipal_supplier_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "pcipal_supplier_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/subscriptions/abd7d0f5-77bc-462c-a658-c8d1e1b40837"
        # (10 unchanged attributes hidden)
    }

  # module.payment-database-v15.azurerm_monitor_action_group.db-alerts-action-group[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_monitor_action_group" "db-alerts-action-group" {
      - enabled             = true -> null
      - id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/payment-postgres-db-v15-data-prod/providers/Microsoft.Insights/actionGroups/db_monitor_ag-payment-postgres-db-v15-prod" -> null
      - location            = "global" -> null
      - name                = "db_monitor_ag-payment-postgres-db-v15-prod" -> null
      - resource_group_name = "payment-postgres-db-v15-data-prod" -> null
      - short_name          = "db_monitor_a" -> null
      - tags                = {
          - "application"         = "fees-and-payments"
          - "builtFrom"           = "https://github.com/HMCTS/ccpay-payment-app.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#cc-payments"
          - "environment"         = "production"
          - "managedBy"           = "Fees/Pay"
        } -> null

      - email_receiver {
          - email_address           = (sensitive value) -> null
          - name                    = "Email Receiver" -> null
          - use_common_alert_schema = true -> null
        }
    }

  # module.payment-database-v15.azurerm_monitor_metric_alert.db_alert_cpu[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_monitor_metric_alert" "db_alert_cpu" {
      - auto_mitigate            = true -> null
      - description              = "Whenever the cpu utilization is greater than 80%" -> null
      - enabled                  = true -> null
      - frequency                = "PT5M" -> null
      - id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/payment-postgres-db-v15-data-prod/providers/Microsoft.Insights/metricAlerts/db_cpu_percent_payment-postgres-db-v15-prod" -> null
      - name                     = "db_cpu_percent_payment-postgres-db-v15-prod" -> null
      - resource_group_name      = "payment-postgres-db-v15-data-prod" -> null
      - scopes                   = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/payment-postgres-db-v15-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/payment-postgres-db-v15-prod",
        ] -> null
      - severity                 = 1 -> null
      - tags                     = {
          - "application"         = "fees-and-payments"
          - "builtFrom"           = "https://github.com/HMCTS/ccpay-payment-app.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#cc-payments"
          - "environment"         = "production"
          - "managedBy"           = "Fees/Pay"
        } -> null
      - window_size              = "PT15M" -> null
        # (2 unchanged attributes hidden)

      - action {
          - action_group_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/payment-postgres-db-v15-data-prod/providers/Microsoft.Insights/actionGroups/db_monitor_ag-payment-postgres-db-v15-prod" -> null
        }

      - criteria {
          - aggregation            = "Average" -> null
          - metric_name            = "cpu_percent" -> null
          - metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers" -> null
          - operator               = "GreaterThanOrEqual" -> null
          - skip_metric_validation = false -> null
          - threshold              = 80 -> null
        }
    }

  # module.payment-database-v15.azurerm_monitor_metric_alert.db_alert_memory[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_monitor_metric_alert" "db_alert_memory" {
      - auto_mitigate            = true -> null
      - description              = "Whenever the memory utilization is greater than 80%" -> null
      - enabled                  = true -> null
      - frequency                = "PT5M" -> null
      - id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/payment-postgres-db-v15-data-prod/providers/Microsoft.Insights/metricAlerts/db_memory_percent_payment-postgres-db-v15-prod" -> null
      - name                     = "db_memory_percent_payment-postgres-db-v15-prod" -> null
      - resource_group_name      = "payment-postgres-db-v15-data-prod" -> null
      - scopes                   = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/payment-postgres-db-v15-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/payment-postgres-db-v15-prod",
        ] -> null
      - severity                 = 1 -> null
      - tags                     = {
          - "application"         = "fees-and-payments"
          - "builtFrom"           = "https://github.com/HMCTS/ccpay-payment-app.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#cc-payments"
          - "environment"         = "production"
          - "managedBy"           = "Fees/Pay"
        } -> null
      - window_size              = "PT15M" -> null
        # (2 unchanged attributes hidden)

      - action {
          - action_group_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/payment-postgres-db-v15-data-prod/providers/Microsoft.Insights/actionGroups/db_monitor_ag-payment-postgres-db-v15-prod" -> null
        }

      - criteria {
          - aggregation            = "Average" -> null
          - metric_name            = "memory_percent" -> null
          - metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers" -> null
          - operator               = "GreaterThanOrEqual" -> null
          - skip_metric_validation = false -> null
          - threshold              = 80 -> null
        }
    }

  # module.payment-database-v15.azurerm_monitor_metric_alert.db_alert_storage_utilization[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_monitor_metric_alert" "db_alert_storage_utilization" {
      - auto_mitigate            = true -> null
      - description              = "Whenever the storage utilization is greater than 80%" -> null
      - enabled                  = true -> null
      - frequency                = "PT5M" -> null
      - id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/payment-postgres-db-v15-data-prod/providers/Microsoft.Insights/metricAlerts/db_storage_utilization_payment-postgres-db-v15-prod" -> null
      - name                     = "db_storage_utilization_payment-postgres-db-v15-prod" -> null
      - resource_group_name      = "payment-postgres-db-v15-data-prod" -> null
      - scopes                   = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/payment-postgres-db-v15-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/payment-postgres-db-v15-prod",
        ] -> null
      - severity                 = 1 -> null
      - tags                     = {
          - "application"         = "fees-and-payments"
          - "builtFrom"           = "https://github.com/HMCTS/ccpay-payment-app.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#cc-payments"
          - "environment"         = "production"
          - "managedBy"           = "Fees/Pay"
        } -> null
      - window_size              = "PT15M" -> null
        # (2 unchanged attributes hidden)

      - action {
          - action_group_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/payment-postgres-db-v15-data-prod/providers/Microsoft.Insights/actionGroups/db_monitor_ag-payment-postgres-db-v15-prod" -> null
        }

      - criteria {
          - aggregation            = "Average" -> null
          - metric_name            = "storage_percent" -> null
          - metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers" -> null
          - operator               = "GreaterThanOrEqual" -> null
          - skip_metric_validation = false -> null
          - threshold              = 80 -> null
        }
    }

  # module.sdp_db_user[0].data.azurerm_key_vault.sdp_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "sdp_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "mi-vault-prod"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "mi-prod-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.sdp_db_user[0].data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_name" {
      ~ id                      = "https://mi-vault-prod.vault.azure.net/secrets/payment-postgres-db-v15-prod-read-user-name/0b12a9c9635248b09e89a555c87e1c5a" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod" -> (known after apply) # forces replacement
        name                    = "payment-postgres-db-v15-prod-read-user-name"
      ~ resource_id             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/payment-postgres-db-v15-prod-read-user-name/versions/0b12a9c9635248b09e89a555c87e1c5a" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/payment-postgres-db-v15-prod-read-user-name" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "0b12a9c9635248b09e89a555c87e1c5a" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-prod.vault.azure.net/secrets/payment-postgres-db-v15-prod-read-user-name" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_password" {
      ~ id                      = "https://mi-vault-prod.vault.azure.net/secrets/payment-postgres-db-v15-prod-read-user-password/fe42657debc148fdbb53dff49bcea488" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod" -> (known after apply) # forces replacement
        name                    = "payment-postgres-db-v15-prod-read-user-password"
      ~ resource_id             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/payment-postgres-db-v15-prod-read-user-password/versions/fe42657debc148fdbb53dff49bcea488" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/payment-postgres-db-v15-prod-read-user-password" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "fe42657debc148fdbb53dff49bcea488" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-prod.vault.azure.net/secrets/payment-postgres-db-v15-prod-read-user-password" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 6 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1807,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->